# MatchesFormat Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EffectInstance..::..MatchesFormat Method
EffectInstance Class See Also
---
Tests whether the effect instance is appropriate for the given vertex format.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool MatchesFormat(
	VertexFormat vertexFormat
)
```

Visual Basic
---
```text
Public Function MatchesFormat ( _
	vertexFormat As VertexFormat _
) As Boolean
```

Visual C++
---
```text
public:
bool MatchesFormat(
	VertexFormat^ vertexFormat
)
```

# ### Parameters
vertexFormat
    Type: Autodesk.Revit.DB.DirectContext3D..::..VertexFormat A vertex format.
# ### Return Value
True if the effect instance is valid for use with the specified vertex format.
# Remarks
The vertex format may define vertex data that are not used by the effect instance. However, the effect instance can not reference vertex data that do not exist in the vertex format.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace